"""Изучите список:

a = [1, 1, 2, 3, 5, 8, 34, 55, 89].

Напишите код: выведите все элементы списка, которые меньше 5."""

a = [1, 1, 2, 3, 5, 8, 34, 55, 89]
b = []
for i in a:
    if i < 5:
        b.append(i)
print(b)